<template>
    <div id="ruleText">
        前言 欢迎您选择使用斩龙互娱平台！ 斩龙互娱平台（下文亦称为“本平台”）将遵循国家对网络游戏管理的相关规定，努力为玩家提供更优质的服务。 重要须知<br><br>
        一、您在使用本平台游戏（定义见第二条第1款）及本平台服务（定义见第二条第2款）之前，请仔细阅读《斩龙互娱平台用户协议》（下文亦统称为“本协议”）中各条款。本平台特别提醒用户认真阅读本协议的全部条款，特别是其中免除或者限制本平台责任的条款（该等条款通常含有“不负任何责任”、“无义务”、“不保证”等词汇）、限制用户权利的条款（该等条款通常含有“不得”、“不应”、“无权”等词汇）、法律适用和争议解决条款，这些条款应在中国法律所允许的范围内最大程度地适用，该类条款通常用粗体标示。<br>
        二、您一旦下载、安装、使用本平台游戏，或者注册、开始使用及/或继续使用本平台服务，即视为您同意并已经接受本协议中全部条款。您确认此后将不会以未阅读/未同意本协议内容或类似理由提出任何形式的抗辩。<br>
        三、您有权在接受本平台服务期间，监督本平台及工作人员是否按照本平台所公布的标准提供服务，也可以随时向本平台提出与本平台游戏和本平台服务有关的意见和建议。<br>
        四、如果您是未成年人，在决定使用本平台游戏、本平台服务之前，您应该和您父母或者监护人一起阅读本协议，以确保他们理解协议的内容。在未获得父母或者监护人的同意之前，您不得使用本平台游戏、本平台服务。使用本平台游戏、本平台服务即表示：您声明并保证已满18岁或者18岁以上；或您已经获得父母或者监护人的允许使用。此外，本平台建议父母和监护人在孩子使用网络、移动手机和其它设备的时候进行监督和指导。 <br>
        第一条协议签署方 本协议在如下双方之间签署：<br>
        1.本平台，即斩龙互娱网络科技有限公司/或其关联公司通过自有的网站与平台、合作方的网站与平台向您提供本平台服务。<br>
        2.您，又称“玩家”或“用户”。即通过合法途径，获得游戏权利人非商业使用性质之非专有授权，从而下载、安装、使用本平台游戏或接受本平台服务的自然人。<br>
        第二条定义和说明 如无相反说明，以下词语具有如下含义： <br>
        1.本平台游戏：指游戏权利人通过本平台向用户提供的游戏软件（包括任何可在移动智能设备及/或电脑终端上，以移动端/客户端或网页等形式进行操作的适配版本），以及与该等游戏软件相关的更新、升级、补丁、资料片等。并可能包括相关的网络服务器、网站（包括但不限于该游戏之官方网站或官方论坛)、电子媒体、印刷材料或电子文档等。 <br>
        2.本平台服务：指本平台向用户提供的、与前述本平台游戏相关的各项在线服务，具体为游戏的上传存储空间、下载、预约、测试、跳转链接等必要的技术支持服务，以及用户登录系统服务及支付系统服务，但并不包括本平台游戏本身的发行、运营、推广服务。 <br>
        3.增值服务代用币：指为满足用户在本平台服务中的正常交易交流需求，而设计的一种虚拟道具，通过人民币兑换等途径获得，可用于换取游戏中指定的各类增值服务，仅限于在特定游戏中使用和流通。 <br>
        4.游戏权利人，又称“第三方游戏开发商”：指通过合法途径，有权通过本平台以其自身名义发行、运营、推广游戏，向用户授予非商业使用性质之非专有授权安装、运行本平台游戏的权利人。 <br>
        第三条知识产权声明：<br>
        1.本平台依法享有本平台服务的一切合法权益（包括但不限于其中涉及的计算机软件著作权、美术作品著作权和专利权等知识产权，以及提供本平台游戏的权利等），或已从合法权利人处取得合法授权，从而有权为用户提供本平台服务。 <br>
        2.本平台服务所体现的“斩龙互娱”、“斩龙互娱平台”等文字、LOGO（图形），以及在具体服务中使用的用以标识服务名称与来源的文字、LOGO（图形）等（包括但不限于本平台服务的名称、LOGO、ICON等），属于本平台及/或其关联公司、合作公司在中国及/或其他国家/地区的商标或者注册商标。 <br>
        3.本平台服务可能涉及第三方知识产权，如该等第三方对用户在本平台服务中使用该等知识产权有要求的，用户应当遵守该等要求。<br>
        4.本协议未明确授予用户的权利均由本平台保留。 <br>
        第四条本平台服务使用许可与限制：<br>
        1.在用户同意接受本协议全部条款的前提下，本平台同意授予用户非商业使用性质的、可撤销的、可变更的、非专有的、不可转让和不可转授权的使用本平台服务的权利。此外，用户可在游戏权利人授权范围内将本平台游戏安装在供个人使用的移动智能设备或电脑终端上，并以游戏权利人指定的方式运行本平台游戏的一份副本。 本平台基于本协议授予用户的许可是针对个人使用的许可。如用户有需要在个人使用的范围以外使用本平台服务，或者将本平台服务与本平台游戏用于任何商业用途，则用户应与本平台和游戏权利人联系并获得本平台和游戏权利人的另行授权。任何未经本平台许可使用本平台服务的行为，或者未经游戏权利人许可使用本平台游戏的行为均属侵权。 <br>
        2.除非本协议另有约定，否则，未经本平台事先书面同意，用户不得实施下列行为（无论是营利的还是非营利的）： <br>
        (1)复制、翻录、反编译（de-compile）、反汇编（disassemble）、传播和陈列本平台服务的程序、使用手册和其它图文音像资料的全部或部分内容，或对本平台服务的任何功能或程序进行反向工程（reverse engineering）。 <br>
        (2)公开展示和以各种形式、在各种平台（包括但不限于网络直播平台、网站、APP等）播放本平台服务的全部或部分内容。 <br>
        (3)出租、销售本平台服务或者利用本平台服务从事任何营利行为。 <br>
        (4)修改或遮盖本平台服务程序、图像、动画、包装和手册等内容上的服务名称、公司标志、商标（或）版权信息、其他知识产权声明等内容。 <br>
        (5)其它违反《商标法》、《著作权法》、《专利法》、《计算机软件保护条例》和相关法律法规、国际条约的行为。 <br>
        3.本平台游戏是由第三方游戏开发商提供的，第三方游戏开发商赋予用户根据他们提供的游戏相关条款而使用他们游戏的许可。 用户在此承诺使用本平台游戏时，用户应就相应游戏的使用与第三方游戏开发商签订具有法律约束效力的合同，并依据前述合同向该第三方游戏开发商就本平台游戏的使用事宜履行义务或主张权利。本平台并非用户和相关第三方游戏开发商之间关于本平台游戏使用许可合同的当事方。每个第三方游戏开发商对其提供的相关游戏、游戏内容以及相关发布、运营、推广行为全权负责。 <br>
        第五条资费政策：<br>
        1.本平台有权决定本平台服务的收费方式和资费标准，本平台有权就本平台服务在不同阶段确定不同的收费方式和资费标准，且本平台有权根据需要对资费政策随时进行调整。具体收费方式、资费标准，包括但不限于本平台服务的收费标准以及增值服务（如有）的具体收费标准等，均由本平台在APP STORE或其他APP发布渠道、游戏内道具商城、道具购买界面、本平台官网等模块上，以网络游戏行业通用的形式颁布。 <br>
        2.本平台游戏由游戏权利人通过本平台向用户提供。用户还需要接受游戏权利人的协议和收费才能下载、安装和运行他们的游戏。用户特此确认知悉，游戏权利人可以保留调整资费的权利并且在用户购买相应的游戏之前适时提前告知用户。新的价格生效后，用户需要接受新调整的价格才能够继续使用游戏。如果用户不同意应用调整后的价格，应当停止使用本平台游戏。 <br>
        3.用户有义务在选择前仔细阅读，一旦用户选择下载收费的本平台游戏、购买相关虚拟物品使用权或者接受本平台服务，则表明用户已经充分理解并接受相应的收费方式和资费标准。 <br>
        4.本平台有权根据需要，在本平台或本平台游戏中设立、添加、修改增值服务并发行增值服务代用币。增值服务代用币通过使用人民币兑换获得，人民币一经兑换成增值服务代用币，则视为人民币已经使用，增值服务代用币不可兑换成人民币；增值服务代用币用于购买本平台游戏内相关虚拟道具使用权或者接受相关增值服务。 <br>
        5.在以用户购买虚拟物品的使用权或者以接受其他增值服务作为收费项目的情况下，如超出该虚拟物品的有效使用期限或增值服务的有效服务期限（不管用户是否已经实际使用或者享受服务），或者超出有效使用或服务次数，本平台即有权采取措施取消用户对上述虚拟物品的使用权或者停止提供增值服务。 <br>
        6.用户可以通过第三方支付公司或运营商支付费用。用户特此确认知悉，本平台无需提前告知便可单方酌情决定增加或者删除任何一种支付渠道。用户同意遵守上述支付渠道规定并且遵守他们的用户服务协议。用户应仔细地阅读上述支付渠道的隐私保护政策。如果用户不熟悉或者不同意为用户提供服务的支付渠道的政策，应该停止使用服务。用户必须保持其付款账户信息安全。用户不得允许其他人使用其账户信息。否则，用户将承担所有相应的损失。 <br>
        第六条游戏虚拟物品：<br>
        1.游戏虚拟物品（或简称“虚拟物品”）包括但不限于游戏角色、资源、道具（包括但不限于游戏中的武器、坐骑、宠物、装备等）等，其所有权归游戏权利人，用户只能在合乎法律规定的情况下，根据游戏规则进行使用。 <br>
        2.游戏中各类虚拟物品，如对使用期限无特殊标识的，均默认用户可在获得使用权后持续使用，直至相应本平台游戏运营终止；如对使用期限有特殊标识的，则其使用期以特殊标识的期限为准，超过使用期的，游戏权利人有权不另行通知用户而随时收回其使用权。<br>
        第七条用户账号注册、使用与保管：<br>
        1.账号注册用户承诺以其真实身份注册本平台账号或本平台认可的其他合作方账号，并以该等账号（下亦称“用户账号”）接受本平台服务。用户同意，以用户提供的真实准确的个人资料（包括但不限于姓名、年龄、有效身份证件号码、手机号等）作为认定用户与本平台账号的关联性以及用户身份的唯一证据。未以真实身份注册、使用“快速游戏”、“游客”或其他类似便捷模式登录的用户，本平台有权拒绝为其提供游戏内充值消费或者其他服务。 <br>
        2.用户账号使用与保管 <br>
        (1)根据法律法规及本协议的约定，本平台有权审查用户注册时所提供的身份信息是否真实、有效，并应积极地采取技术与管理等合理措施保障用户账号的安全、有效；用户有义务妥善保管用户账号及密码，并正确、安全地使用其用户账号及密码。任何一方未尽上述义务导致用户账号密码遗失、用户账号被盗等情形而给用户或他人的民事权利造成损害的，应当承担由此产生的法律责任。 <br>
        (2)用户对所持用户账号产生的行为依法享有权利和承担责任。 <br>
        (3)一旦发现用户账号或密码被他人非法使用或有使用异常的情况的，用户应及时根据本平台公布的处理方式进行处理，并有权及时通知本平台采取措施暂停该用户账号的登录和使用。 <br>
        (4)本平台根据用户的通知采取措施暂停用户账号的登录和使用的，本平台应当要求用户提供并核实与其注册身份信息相一致的个人有效身份信息或证明。 <br>
        (5)本平台核实用户所提供的个人有效身份信息或证明与所注册的身份信息相一致的，应当及时采取措施暂停用户账号的登录和使用。 <br>
        (6)本平台违反前项⑸的约定，未及时采取措施暂停用户账号的登录和使用，因此而给用户造成损失的，应当承担相应的法律责任。<br>
        (7)用户没有提供其个人有效身份信息或证明，或者用户提供的个人有效身份信息或证明与所注册的身份信息不一致的，本平台有权拒绝用户上述请求。 <br>
        (8)用户为了维护其合法权益，向本平台提供与所注册的身份信息相一致的个人有效身份信息或证明时，本平台应当依法为用户提供账号注册人证明、原始注册信息等必要的协助和支持，并根据需要向有关行政机关和司法机关提供相关证据信息资料。 <br>
        (9)如用户连续365天没有登录游戏，则自第365天当天的24时起，本平台有权采取措施删除该用户账号以及该用户账号在游戏数据库中的任何记录（包括但不限于角色、等级、虚拟物品、增值服务代用币等数据信息），删除后的数据信息无法再恢复。 <br>
        3.如果用户选择通过“快速游戏”、“游客”或其他类似便捷模式，在未注册用户账号的前提下快速登录游戏的，请用户登录后及时绑定用户账号；如用户未绑定用户账号，则一旦用户卸载、重装本平台游戏，更换移动智能设备、电脑，或用户的移动智能设备、电脑损坏导致本平台游戏无法正常启动的，用户在快速模式下的全部游戏数据、充值记录将无法查询、恢复。 <br>
        第八条隐私保护： <br>
        1.本平台尊重和重视用户的个人隐私，为此本平台专门制定了《斩龙互娱平台隐私政策》；该隐私政策对您在使用本平台期间关于收集和处理您个人信息的情况做了非常详细的说明。请您在登录和使用本平台时仔细阅读该隐私政策的全部条款。 <br>
        2.另请您注意，只有当您阅读并同意该隐私政策的全部条款时，您方可使用或继续使用本平台提供的服务；否则您可能无法使用或无法继续使用本平台提供的服务。 <br>
        第九条本平台的义务： <br>
        1.本平台同意通过互联网络，根据本协议约定，为用户提供本平台服务。 <br>
        2.本平台保存增值服务代用币的兑换记录，保存期限为自用户兑换之日起180日。 <br>
        3.在使用本平台增值服务代用币的过程中，用户有权向本平台要求协助调取兑换记录和转移记录，本平台应当要求用户提供并核实与其注册身份信息相一致的个人有效身份信息或证明，本平台核实用户所提供的个人有效身份信息或证明与所注册的身份信息相一致的，应当予以协助提供。用户没有提供其个人有效身份信息或证明，或者用户提供的个人有效身份信息或证明与所注册的身份信息不一致的，本平台有权拒绝用户前述请求。 <br>
        第十条用户的义务： <br>
        1.用户应自行配备上网的所需设备，包括但不限于移动智能设备(包括但不限于手机、平板电脑)、电脑、无线路由器或其他必备上网装置。 <br>
        2.用户自行负担上网所支付的与此服务相关的电信费用、网络使用等费用。 <br>
        3.遵守本协议的约定、其他相关规则和制度的规定(包括但不限于用户点击同意的其他斩龙互娱服务条款，以及本平台和/或游戏权利人在游戏官方网站、游戏官方微博、微信公众号或游戏内公布的规则等)；遵守中华人民共和国相关法律法规(如果用户是中华人民共和国境外的使用者，还应遵守所属国家或地区的法律法规)。 <br>
        第十一条不正当游戏行为： <br>
        1.用户应当自行承担其所发布的信息内容所涉及的责任。特别地，用户不得发布下列内容： <br>
        (1)反对中华人民共和国宪法所确定的基本原则的； <br>
        (2)危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br>
        (3)损害国家荣誉和利益的； <br>
        (4)煽动民族仇恨、民族歧视，破坏民族团结的； <br>
        (5)破坏国家宗教政策，宣扬邪教和封建迷信的； <br>
        (6)散布谣言，扰乱社会秩序，破坏社会稳定的； <br>
        (7)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的； <br>
        (8)侮辱或者诽谤他人，侵害他人合法权益的； <br>
        (9)宣扬、教唆使用外挂、私服以及木马的相关内容的； <br>
        (10)发布任何经本平台合理判断为不妥当或者本平台未认可的软件、文件等在内的主页地址或者链接的； <br>
        (11)含有中华人民共和国法律、行政法规禁止的其他内容的。 <br>
        2.用户不得通过不正当的手段或其他不公平的手段使用本平台游戏、本平台服务或参与本平台活动。 用户不得干扰本平台正常地提供游戏和服务，包括但不限于：攻击、侵入本平台的网站服务器，或集中时间段内以超出正常用户登录需求的高频率登录或尝试登录服务器从而使网站服务器过载；破解、修改本平台游戏程序；攻击、侵入本平台游戏的服务器/游戏服务器端程序或使游戏服务器过载；制作、发布、传播、使用任何形式的妨碍游戏公平性的辅助工具或程序(包括但不限于“外挂”,“外挂”是指独立于游戏软件之外的，能够在游戏运行的同时影响游戏操作的所有程序，包括但不限于模拟用户操作、改变操作环境、修改数据等一切类型）。用户不得：利用程序的漏洞和错误(Bug)破坏游戏的正常进行或传播该漏洞或错误(Bug)；不合理地干扰或阻碍他人使用本平台游戏和本平台服务；通过异常或者非法的方式使用本平台游戏(包括但不限于利用本平台游戏登录游戏私服)；使用异常的方法登录游戏（包括但不限于使用非本平台开发、授权或认可的第三方软件、系统登录游戏）、使用网络加速器等外挂软件或机器人程序等恶意破坏服务设施、扰乱正常服务秩序的行为；修改、翻译、注释、整理、汇编、演绎本平台游戏；利用本平台游戏或者本平台服务可能存在的技术缺陷或漏洞而以各种形式为自己及他人牟利（包括但不限于复制游戏虚拟物品等）或者从事其他不正当行为等。 用户同意以游戏程序中的监测数据作为判断用户是否有通过使用外挂程序等方法进行游戏作弊行为的依据。 <br>
        第十二条服务的中断、中止、终止： <br>
        1.对用户服务的中止与终止 <br>
        (1)用户有发布违法信息、严重违背社会公德、以及其他违反法律禁止性规定的行为，本平台应当立即终止对用户提供服务。 <br>
        (2)用户在接受本平台服务时实施不正当行为的，本平台有权终止对用户提供服务。该不正当行为的具体情形应当在本协议中有明确约定或属于本平台事先明确告知的应被终止服务的禁止性行为，否则，本平台不得终止对用户提供服务。 <br>
        (3)用户提供虚假注册身份信息，或实施违反本协议的行为，本平台有权中止对用户提供全部或部分服务；本平台采取中止措施应当通知用户并告知中止期间，中止期间应该是合理的，中止期间届满本平台应当及时恢复对用户的服务。 <br>
        (4)本平台根据本款⑴、⑵、⑶项的约定中止或终止对用户提供部分或全部服务的，本平台应负举证责任。 <br>
        2.不管由于何种原因终止本平台服务，用户应采取相应的措施自行处理游戏虚拟物品，包括但不限于注销或停止使用用户账号、游戏虚拟物品等相关事宜。用户不得因全面终止本平台服务而要求本平台承担除用户已经购买但尚未使用的增值服务代用币外任何形式的赔偿或补偿责任，包括但不限于因不再能继续使用用户账号、游戏虚拟物品等而要求的赔偿。 <br>
        第十三条有限保证及免责声明： <br>
        1.对于本平台服务，本平台仅作本条所述有限保证，该有限保证取代任何文档、包装、或其他资料中的任何其他明示或默示的保证（若有）。对于本平台游戏，由每个游戏的游戏权利人对其提供的相关游戏、游戏内容、以及相关发布、运营、推广行为全权负责。<br> 
        2.本平台仅以“现有状况且包含所有错误”的形式提供本平台服务，并仅保证： <br>
        (1)本平台服务能基本符合本平台正式公布的要求； <br>
        (2)本平台所提供的相关服务基本与本平台正式公布的服务承诺相符； <br>
        (3)本平台仅在商业上允许的合理范围内尽力解决本平台在提供服务过程中所遇到的任何问题。 <br>
        3.在适用法律允许的最大范围内，本平台明确表示不提供任何其他类型的保证，不论是明示的或默示的，包括但不限于适销性、适用性、可靠性、准确性、完整性、无病毒以及无错误的任何默示保证和责任。 <br>
        4.在适用法律允许的最大范围内，本平台并不担保本平台游戏和本平台服务一定能满足用户的要求，也不担保本平台游戏和本平台服务不会被中断，并且不担保本平台游戏和本平台服务的及时性、安全性及不受干扰，亦不担保无错误发生，以及信息能准确、及时、顺利地传送。 <br>
        5.用户理解并同意：通过本平台游戏和本平台服务所取得的任何信息、资料，是否信任及使用，完全取决于用户自己，并由用户承担由该等信任及使用带来的系统受损、资料丢失以及其它任何风险。本平台对在本平台游戏和本平台服务中提及的任何第三方发出的信息，都不作担保。 <br>
        6.如有系统故障、安全漏洞(Security Vulnerability)、程序缺陷(Bug)、程序出错等问题造成本平台游戏丧失公平性，本平台有权联系游戏权利人把游戏的资料还原到一定日期，以维护游戏之平衡。 <br>
        7.在适用法律允许的最大范围内，本平台对用户因使用本平台游戏和本平台服务引起的任何间接、偶然、意外、特殊或继起的损害(包括但不限于人身伤害、隐私泄漏、因未能履行包括诚信或合理谨慎在内的任何责任、因过失和因任何其他金钱上的损失或其他损失而造成的损害赔偿)不负责任，这些损害可能来自：用户或他人不正当使用产品和服务、在网上购买商品或类似服务、在网上进行交易、非法使用服务或用户传送的信息有所变动。 <br>
        8.本平台对本协议项下涉及的境内外基础电信运营商的固定及移动通信网络的故障，各类技术缺陷、覆盖范围限制、不可抗力、计算机病毒、黑客攻击、用户所在位置、用户关机、合作方因素、他人故意或过失行为或其他非本平台技术能力范围内的原因造成的服务中断、用户发送的数据或短信息的内容丢失、出现乱码、错误接收、无法接收、迟延接收等等，均不承担责任。 <br>
        9.由于用户个人失误、错误或不当操作导致的任何后果，由用户自行承担责任，本平台不予任何赔偿或补偿。 <br>
        第十四条家长监护系统 本平台遵从国家政策，本平台游戏开设“未成年人家长监护系统”，若父母（监护人）同意未成年人（尤其是十岁以下子女）使用产品和服务，必须以父母（监护人）名义申请注册本平台账号。在使用产品和服务时，父母（监护人）应以监护人身份判断产品和服务是否适合未成年人。如果用户未满18周岁（或本平台无法识别用户的年龄），则用户将受到“未成年人家长监护系统”的约束。本平台将有权根据有关规则以及家长的要求，对用户创建或使用本平台账号关联的游戏账号进行限制，包括但不限于临时或永久冻结账号，部分或者全部终止提供本平台各项产品和服务。 <br>
        第十五条防沉迷系统： <br>
        1.如果用户未满法定年龄（或本平台无法识别用户的年龄），则用户在游戏内的活动将受到“游戏防沉迷系统”监测；如果用户拥有一个以上本平台账号，则该“游戏防沉迷系统”将同时适用于该用户的所有本平台账号。 <br>
        2.“游戏防沉迷系统”通过按照连续游戏时间来逐级扣减游戏内收益的方式，对用户长时间连续游戏的行为进行规制。 <br>
        3.用户需提供真实完整的信息以便本平台识别用户的身份并向有关部门提交实名认证信息，如因提供的资料不真实而产生的后果由用户自行承担。 <br>
        4.在现有的技术条件下，本平台将尽合理的商业努力并根据有关监管部门的要求开发并维护“未成年人家长监护系统”、“游戏防沉迷系统”与实名认证系统，按“现状”提供给用户使用。由于技术不可避免的局限性以及系统运作各环节受外界的影响，本平台不保证各系统不存在任何漏洞，不保证各系统能随时正常运作，亦不保证监护或认证效果完全正确真实或满足用户的需求。本平台不提供任何适用法律明确规定之外的明示或默示担保，不对此承担任何责任。 <br>
        第十六条战斗系统特别说明 特定本平台游戏中可能含有战斗系统，在战斗系统里，用户与用户之间可以自由对战。就该类含有战斗系统的本平台游戏，用户一旦点击“接受”（或其他具有同样含义的词，如“同意”等）并安装相应的本平台游戏，或者注册、开始使用及/或继续使用相应的本平台游戏或本平台服务，将视为同意游戏战斗系统中的所有自由对战行为，并同意遵守自由对战的游戏规则。 <br>
        第十七条单机游戏特别说明 主体为单机游戏的本平台游戏中，充值系统仅在接入互联网或移动通信网（短代支付等）后方可使用，如用户使用充值系统进行兑换，将通过互联网或移动通信网（短代支付等）确认兑换信息。主体为单机游戏的本平台游戏中，全部游戏数据将保存在用户的移动智能设备上，一旦用户卸载、重装本平台游戏，更换移动智能设备，或用户的移动智能设备损坏导致本平台游戏无法正常启动的，用户的全部游戏数据将无法恢复。如游戏数据可联网保存的，用户将游戏数据保存在游戏服务器中时，需要联网进行数据保存操作。 <br>
        第十八条惩罚的类型与定义 若用户违反本协议的规定，除了根据其他条款规定受到相应处罚外，还可能会遭受以下一项或几项惩罚: <br>
        (1)警告：警告仅仅是针对违反游戏规则的玩家做出的教育导向，它是用于正常管理游戏运行的一种方式。 <br>
        (2)禁言：关闭违规玩家的部分或全部聊天频道，强制暂停玩家用户账号的线上对话功能，使玩家用户账号无法与其他玩家对话，直到此次处罚到期或是取消。 <br>
        (3)暂时冻结玩法：将违规玩家的游戏角色进行限制，限制其局部游戏操作，直到此次处罚到期或是取消。 <br>
        (4)永久冻结玩法：将违规玩家的游戏角色进行限制，限制其局部游戏操作，且永久不予以解除或释放。 <br>
        (5)暂时禁止登录：违规玩家的用户账号将在一定的时间内暂时无法登录使用本平台的某个或者某几个游戏，直到此次处罚到期或是取消。 <br>
        (6)永久禁止登录：违规玩家的用户账号将永久无法登录使用本平台服务。 <br>
        (7)强制离线：强制让违规玩家离开当前游戏，结束玩家当前游戏程序的执行。 <br>
        (8)封停账号：暂停或永久停止违规玩家游戏账号登录本平台游戏的权利。 <br>
        (9)删除档案：将违规玩家在游戏世界中的人物档案删除，不让该人物再出现在游戏世界。 <br>
        (10)承担法律责任：玩家的不当行为对他人或者本平台造成损害或者与现行法律规定相违背的，违规玩家要依法承担相应的民事、行政或刑事责任。 <br>
        (11)解散组织：解散玩家成立的包括但不限于帮派、工会、势力等组织。 <br>
        (12)修改昵称：对于玩家包括但不限于人物昵称、帮派名称、摊位名称、商店名称、宠物名称、召唤兽昵称、空间名称、公会名称、社区名称等可以由玩家自主命名的昵称或名称进行强制修改。 <br>
        (13)暂时限制游戏行为：违规玩家的用户账号将在一定的时间内被限制使用部分游戏服务。 <br>
        (14)撤销交易：撤销违规交易、将交易双方付出的游戏虚拟物品予以还原。 <br>
        (15)扣除违规交易所得：扣除违规交易中，违规一方或违规双方所获得的游戏虚拟物品。 <br>
        (16)交易功能限制：暂时冻结违规交易中，违规一方或违规双方所获得的游戏虚拟物品，并持续考察其在指定期限内的游戏内行为。如指定期限内其无再次违规的，到期自动解冻相应的游戏虚拟物品；如指定期限内其再次违规的，在本平台认定其违规行为存在时扣除其被冻结的游戏虚拟物品。 <br>
        (17)冻结游戏虚拟物品：对违规玩家限定其游戏角色的游戏虚拟物品的相关功能，包括但不限于物品的使用、交易、给予等。 <br>
        (18)收回游戏虚拟物品：对于玩家因欺诈或其他违规行为而获取的游戏虚拟物品，包括但不限于游戏虚拟物品进行收回。 <br>
        (19)其他处罚措施：包括但不限于没收不正当利益（如玩家通过不正当途径获得的游戏虚拟物品）、倒扣数值（包括但不限于经验值等）、删除论坛帖子、屏蔽论坛账号、暂时中断服务等。 <br>
        第十九条游戏内反骚扰处理规则 本平台倡议玩家对自己的言行负责，文明游戏，健康游戏，若玩家出现本条约定的以下情形，将会被按照本条的规定进行处罚。<br>
        (1)冒充系统：在游戏中，凡是通过各种方式、行为冒充系统向其他玩家散布或传播虚假信息，根据情况将有可能受到以下处罚：警告；禁言；暂时冻结玩法；永久冻结玩法；暂时禁止登录；永久禁止登录。 <br>
        (2)非法网站：为了维护游戏世界中的洁净与和谐，凡是宣扬非法网站的，根据情况将有可能受到以下处罚：警告；禁言；暂时冻结玩法；永久冻结玩法；暂时禁止登录；永久禁止登录。 <br>
        (3)言行不雅：在游戏中，凡是通过各种方式、行为散布或传播言行不雅的信息，根据情况将有可能受到以下处罚：警告；禁言；暂时冻结玩法；永久冻结玩法；强制离线；暂时禁止登录。 <br>
        (4)垃圾广告信息：大量传播相同的、类似短语或无实质意义内容的言行，以及任何与所在游戏无关的信息(包括但不限于刷屏等)，或者发布、传播任何贬损、诋毁、恶意攻击所在游戏或本平台的信息或者其他不实信息，根据情况将有可能受到以下处罚：警告；禁言；暂时冻结玩法；永久冻结玩法；强制离线；暂时禁止登录；永久禁止登录。 <br>
        (5)地区分裂：在游戏中，凡是通过各种方式或途径引起地区纷争的行为，根据情况将有可能受到以下处罚：警告；禁言；暂时冻结玩法；永久冻结玩法；强制离线；暂时禁止登录；永久禁止登录。 <br>
        (6)违禁药品或行为：在游戏中，凡是涉及违禁药品的行为，根据情况将有可能受到以下处罚：警告；禁言；暂时冻结玩法；永久冻结玩法；强制离线；暂时禁止登录；永久禁止登录。 <br>
        (7)现实生活信息和人身恐吓：凡是涉及任何与游戏世界无直接关系的暴力行为，以及泄漏其它玩家或本平台员工的任何游戏世界和现实生活信息，根据情况将有可能受到以下处罚：禁言；强制离线；暂时冻结玩法；永久冻结玩法；暂时禁止登录；永久禁止登录；承担法律责任。 <br>
        (8)宣传或使用木马、外挂、病毒等信息：在游戏中，凡是通过各种方式、行为散布或传播、使用木马、外挂、病毒等信息，根据情况将有可能受到以下处罚：禁言；暂时冻结玩法；永久冻结玩法；暂时禁止登录；永久禁止登录；强制离线；封停账号；删除档案；承担法律责任。永久冻结玩法；暂时禁止登录；永久禁止登录；强制离线；封停账号；删除档案；承担法律责任。 <br>
        (9)宣传代练：在游戏中，凡是通过各种方式、行为散布或传播代练的信息，根据情况将有可能受到以下处罚：禁言；暂时冻结玩法；永久冻结玩法；暂时禁止登录；永久禁止登录；强制离线；封停账号；删除档案。 <br>
        (10)宣传或进行线下交易：用户只可在游戏内或者通过本平台认可的交易平台（如有）进行游戏虚拟物品交易。对于用户在任何非本平台事先认可的充值平台或其他交易平台进行充值或进行其他交易的相关行为（包括但不限于用户通过第三方进行充值或游戏内虚拟物品的购买），本平台将予以严厉打击和处罚。一经查证属实，本平台有权视具体情况采取各种处理措施，包括但不限于如下一项或几项：警告、倒扣数值、冻结或回收游戏虚拟物品、暂时冻结玩法、永久冻结玩法、强制离线、封停账号、删除档案及采取其他技术措施防止用户从事该等行为；情节严重的，本平台保留追究用户法律责任的权利。 <br>
        (11)宣传或发布违法信息，严重违反社会公德：在游戏中，凡是涉及违反国家法律、违背社会道德文明准则的言语或行为，包括但不限于宣传或参与赌博、宣传邪教等行为，玩家将受到以下处罚：警告；禁言；强制离线；暂时冻结玩法；永久冻结玩法；暂时禁止登录；永久禁止登录；删除档案；承担法律责任。 <br>
        (12)其他骚扰行为：除本条上述情形外，若玩家出现其他不符合法律法规、社会公德或游戏规则的骚扰情形，根据情况将可能受到以下处罚：警告；禁言；暂时冻结玩法；永久冻结玩法；暂时禁止登录；永久禁止登录；强制离线；封停账号；删除档案；承担法律责任。 <br>
        第二十条游戏管理员(以下简称“GM”)交互管理规则 <br>
        1.在游戏过程中，玩家可能会因为种种原因与GM进行交流。本平台视具体情况可就具体游戏提供留言板或游戏论坛作为玩家和GM之间的交流平台。如果在该游戏中遇到问题，玩家可以通过留言板或论坛提交问题，它将给玩家提供快速、优质的服务。 <br>
        2.希望GM与玩家的交流能对玩家有所帮助，但请玩家遵守相关规定。游戏权利人或受游戏权利人授权之本平台（以下统称“游戏相关权利人”）将严肃处理以下行为： <br>
        (1)冒充系统或GM：在游戏中，可能会存在某些玩家冒充系统或GM的行为。如若发现，用户可以通过留言板或游戏论坛向GM举报，并协助查证。一经查实，将对其采取严厉的处罚措施。 <br>
        (2)欺骗或试图欺骗GM：在游戏中，玩家不要试图利用本平台对用户的信任，做出某些欺骗或试图欺骗GM的行为。如若发现，将对该等玩家采取严厉的处罚措施。试图欺骗GM的行为包括但不限于误导GM、拒绝提供信息、提供虚假信息以及任何试图“诈骗”GM的行为。 <br>
        (3)违反或忽视GM做出的提示：在游戏中，为了确保大多数玩家的共同利益，维护正常的游戏秩序，GM可能会提示玩家执行某些操作或停止执行某些操作，任何忽视或阻挠该项工作的行为都可能导致玩家游戏人物受到处罚。因此，玩家应当保持合作态度。 <br>
        (4)干扰GM工作：在游戏中，如若出现以下行为，将对其采取严厉的处罚措施： ①向GM索取任何虚拟游戏物品（包括但不限于游戏资源、装备等）； ②频繁呼叫GM或发送无实质性内容的请求； ③反复向GM发送已解答或解决问题的帮助请求。 <br>
        (5)辱骂或恶意攻击GM：在游戏中，不允许出现辱骂或恶意攻击GM的言行。如若发现，将对其采取严厉的处罚措施。 <br>
        (6)扰乱游戏秩序：在游戏中，如若出现以下行为，将对其采取严厉的处罚措施： ①长时间停留在敏感地区（包括但不限于活动报名人、礼包发放人、传送人处）或恶意阻挡NPC； ②任何恶意PK、清场、勒索等行为； ③扬言或煽动其他玩家参与非正常游戏内容的行为（包括但不限于游行、聚众闹事等）。 <br>
        3.若发现玩家违反本条第2款中的任何一项，根据情况将可能受到以下处罚：警告；禁言；暂时冻结玩法；永久冻结玩法；暂时禁止登录；永久禁止登录；强制离线；封停账号；删除档案；删除留言板发言或论坛帖子；屏蔽论坛账号；暂时中断服务；承担法律责任。 <br>
        4.取回密码：如遇密码遗忘、丢失等情况，请玩家第一时间尝试自行登录“用户中心”页面进行操作取回。如无法取回，则可联系本平台客服人员，本平台将有专门的工作人员为玩家查证处理。 玩家以本平台认可的合作方账号登录游戏的，如遇密码遗忘、丢失等情况，则请玩家第一时间联系提供该账号注册服务的主体（即本平台认可的合作方）进行处理。 温馨提醒：任何GM和本平台工作人员均不会在游戏、留言板或论坛中向玩家索要密码等信息，请玩家注意识别，以免造成不必要的损失。 <br>
        第二十一条命名管理规则 虽然人物昵称、玩家所建立的组织名称等可以由玩家来命名，但是为了维护游戏世界中的洁净与和谐，游戏相关权利人不允许出现包括但不限于涉及种族/宗教、国家政治、国家领导人、淫秽的/粗俗的、诽谤/恐吓、宗教或宗教人物、工作人员、攻击性的、污辱性的、可能引起误会的、违禁药品等内容的名称。 如若发现前述情形，违规玩家根据情况将有可能受到以下处罚：警告；禁言；暂时冻结玩法；永久冻结玩法；强制离线；暂时禁止登录；永久禁止登录；修改昵称；解散组织。 <br>
        第二十二条利用游戏Bug以及第三方软件处理规则 1.游戏BUG指游戏系统、程序、设定等方面存在的漏洞或不合理的现象。 玩家有义务向GM报告在游戏中出现的BUG。严禁玩家直接或间接利用游戏BUG、程序漏洞等获利或扰乱游戏秩序，或者利用BUG、漏洞以达到个人目的。如果玩家有该等行为，一经查实，可能受到如下处罚措施：没收玩家利用BUG进行游戏而直接、间接获得之不正当利益；倒扣数值（包括但不限于经验值）；撤销交易；扣除违规交易所得；交易功能限制；强制离线；暂时冻结玩法；永久冻结玩法；暂时禁止登录；永久禁止登录；删除档案；承担法律责任。 2.未经许可的第三方软件指可用于在游戏中获取优势，但不属于相应本平台游戏一部分的任何文件或程序，包括作弊性质的外挂以及相关辅助性质的外挂等（包括但不限于自动升级、自动练级、自动吃药、自动完成任务、加速性质、模拟加点、战斗显血或其他超出游戏设定范围的操作）。如若发现使用作弊性质的外挂以及相关辅助性质的外挂等，游戏相关权利人将对其采取严厉的处罚措施，包括：没收玩家利用第三方软件进行游戏而直接、间接获得之不正当利益；倒扣数值（包括但不限于经验值）；撤销交易；扣除违规交易所得；交易功能限制；暂时冻结玩法；永久冻结玩法；强制离线；暂时禁止登录；永久禁止登录；删除档案；承担法律责任。 任何与本平台游戏同时使用的外部第三方软件可能会对游戏产生不良的影响。使用外部应用程序可能造成的主要后果是数据传送不流畅，导致玩家频繁掉线或卡机。外部应用软件可能使玩家移动智能设备（包括但不限于手机、平板电脑）、电脑等感染病毒、间谍软件和其他不明程序的侵扰。第三方软件还可能窃取玩家存储在移动智能设备（包括但不限于手机、平板电脑）、电脑中的信息，例如账号、密码等个人信息。 <br>
        第二十三条盗号与盗号相关行为处理规则 为保障玩家能愉悦的体验游戏，保障玩家的正当利益不受到侵害，游戏相关权利人对盗号及盗号相关行为（包括但不限于盗取用户账号、游戏数据、玩家个人资料、协助盗号者操作及转移游戏虚拟物品等行为）将予以严厉打击和处罚。一经查证属实或应有权机关的要求，游戏相关权利人有权视具体情况立即采取暂时限制游戏行为、收回游戏虚拟物品、暂时禁止登录、永久禁止登录、封停账号、删除档案等处罚措施，情节严重的，游戏相关权利人保留对涉案玩家追究法律责任的权利。 尽管用户未主动参与盗号，但如用户获得的游戏虚拟物品是他人通过盗号方式获得，而后转移或者分配给用户的，为了维护被盗玩家的权益及游戏中公平公正的游戏秩序，游戏相关权利人有权收回用户购买的该游戏虚拟物品。 在查证玩家被盗事件的过程中，为能够快速调查、处理问题，游戏相关权利人可能会请相关玩家协助调查，其方式包括但不限于禁止登录调查、线上交流、线下交流等。 <br>
        第二十四条游戏内欺诈行为处理规则 诚实信用是游戏中的基本原则。游戏中的欺诈行为是指以非法占有为目的，通过虚假承诺、虚构事实、隐瞒真相、故意误导、冒充他人、故意混淆等方式，骗取他人的游戏虚拟物品或其它财物。游戏内的欺诈行为包括昵称相似欺诈、冒充好友、冒充官方及其他形式。 如玩家在游戏内进行欺诈，游戏相关权利人将根据玩家欺诈情节，采取各种处理措施，包括但不限于如下一项或几项：收回游戏虚拟物品；倒扣数值（包括但不限于经验值）；暂时冻结玩法；永久冻结玩法；强制离线；暂时禁止登录；永久禁止登录。 尽管用户未主动参与欺诈，但如用户获得的游戏虚拟物品是他人通过欺诈方式获得，而后转移或者分配给用户的，为了维护被盗玩家的权益及游戏中公平公正的游戏秩序，游戏相关权利人有权收回用户购买的该游戏虚拟物品。 <br>
        第二十五条与充值相关的不诚信行为处理规则 诚实信用也是用户在充值相关行为中应遵循的基本原则。用户使用本平台服务成功为本平台游戏充值获得虚拟物品使用权或增值服务（以下统称“充值收益”）后，如对本平台服务有任何误会、不满意、建议或其他诉求的，可随时通过客服通知本平台。用户未选择该等方式而是另行进行退款操作的，应立即通过客服专区或客服电话通知本平台扣除相应的充值收益；如用户进行退款操作后仍占有充值服务的属不诚信行为，本平台将予以严厉打击和处罚，包括但不限于如下一项或几项：警告、倒扣数值、冻结或回收游戏虚拟物品、暂时冻结玩法、永久冻结玩法、强制离线、封停账号、删除档案及采取其他技术措施防止用户从事该等行为；情节严重的，本平台保留追究用户法律责任（包括但不限于民事责任、刑事责任）的权利。 <br>
        第二十六条数据异常处理规则 1.如果游戏相关权利人本平台根据本平台或游戏服务器数据发现并判断用户数据异常或者存在违法或者其他不正当行为，“其他不正当行为”包括但不限于： <br>
        (1)利用bug或非正常方式篡改游戏兑换数据、游戏内的兑换排名的行为； <br>
        (2)不以正常的游戏娱乐互动需要为目的进行交易； <br>
        (3)以转移游戏虚拟物品或提升特定游戏角色实力为目的的非正常交易行为，包括但不限于购买并非自身游戏角色游戏所需的游戏虚拟物品、以不正常价格交易游戏虚拟物品、以自己控制的多个游戏账号互相交易游戏虚拟物品等。 <br>
        2.游戏相关权利人本平台有权进行调查并采取相应措施，包括但不限于： <br>
        (1)删除游戏虚拟物品； <br>
        (2)没收不正当利益； <br>
        (3)数据回退或清零； <br>
        (4)禁言； <br>
        (5)暂时禁止登录； <br>
        (6)永久禁止登录； <br>
        (7)暂时隔离； <br>
        (8)永久隔离； <br>
        (9)强制离线； <br>
        (10)撤销交易； <br>
        (11)扣除违规交易所得； <br>
        (12)交易功能限制； <br>
        (13)封停直至删除用户账号等。 <br>
        3.用户无权因此要求本平台游戏相关权利人承担任何责任。 <br>
        第二十七条牟取不正当利益行为处理规则 用户理解并同意，本平台向用户提供本平台服务，是为了让用户体验丰富多彩的游戏内容，而非利用本平台服务赚取现实世界的金钱或牟取经济利益。而用户不以体验游戏内容为目的，在游戏中主要进行交易和牟利的行为，会破坏游戏内经济系统的公平性或平衡性，从而对其他用户的游戏体验、游戏本身造成不利影响。 因此，用户承诺不以营利为目的从事游戏行为或交易虚拟物品，任何以营利为目的从事游戏行为或交易虚拟物品的情形将被视为牟取不正当利益，包括但不限于用户： <br>
        (1)注册多个用户账号和/或游戏角色ID，以营利为目的进行游戏行为； <br>
        (2)从事游戏内单一或系列产出玩法，将获得的虚拟物品出售获利； <br>
        (3)利用不同服务器的虚拟物品价值差异，在不同服务器买卖虚拟物品获利； <br>
        (4)充当游戏账号、虚拟物品交易中介收取费用获利； <br>
        (5)在非本平台提供或认可的交易平台上交易用户账号或虚拟物品获利； <br>
        (6)通过非本平台提供的支付渠道兑换增值服务代用币； <br>
        (7)将游戏内获得的虚拟物品用于出售获利而不注重本身角色实力的提升，角色多个技能、修炼、装备、召唤兽水平与角色等级相差较大的； <br>
        (8)利用游戏行为和游戏内容组织或参与赌博、实施或参与实施盗窃他人财产或虚拟物品等涉嫌违法犯罪行为的； <br>
        (9)其他任何不以正常的游戏娱乐互动需要为目的的游戏内牟利行为。 本平台有权对牟取不正当利益的用户同时采取以下措施：对所有参与牟取不正当利益的用户账号（包括但不限于获得、转移、出售游戏虚拟物品的账号）进行倒扣数值、收回游戏虚拟物品、暂时冻结玩法、永久冻结玩法、强制离线、暂时隔离、永久隔离、封停账号、撤销交易、扣除违规交易所得、交易功能限制、删除档案及采取其他技术措施防止用户从事该等行为；情节严重的，本平台保留追究用户法律责任的权利。 <br>
        第二十八条损害赔偿 如您的违规行为给本平台或第三方造成损害的，您应承担相应的法律责任，而且针对自身的损害本平台有权采取一切合理的行动，包括但不限于收回游戏虚拟物品、增值服务代用币等，本平台并有权向您索回损失额并要求您承担本平台合理的追索费用。 <br>
        第二十九条不可抗拒力事件 <br>
        1.如因本平台服务范围之外并且不在本平台控制范围内的以下情形，用户不能使用本平台服务，本平台不因此对任何损害或赔偿负责。这些情形包含但不局限于下列情况： <br>
        (1)本平台由于执行计划中的维修工作或者更新软件或硬件而中断本服务； <br>
        (2)由于运行商系统故障或者网络连接故障造成的数据传送中断； <br>
        (3)由不可抗力，例如台风、地震、停电、洪水、战争或者恐怖袭击而造成的服务中断； <br>
        (4)由于第三方支付服务故障所引起的本服务功能故障； <br>
        (5)由于虚拟和数字产品及增值服务供应商或者供应商停止运营而引起本服务中断； <br>
        (6)由恶意软件、拒绝服务或者其它类型的黑客攻击而造成的系统服务中断； <br>
        2.如果出现不可抗拒力事件，本平台保留终止本协议中的任一义务的履行和此不可抗拒力事件结束后在合理期间内重置本服务并继续其义务的权利。本平台将合理地尽力结束不可抗拒力事件或者找到一个能使本平台在这样的事件中仍然能够履行其义务的方法。 <br>
        第三十条链接及广告信息 在本平台游戏介绍下载页面、游戏相关留言板或论坛、游戏中所提供的所有链接，可能链接到其他个人、公司或组织的网站，提供该等网站的目的，是便利用户自行搜索或取得相关信息，本平台对于被链接的个人、公司或组织的网站所提供的产品、服务或信息，不担保其真实性、完整性、实时性或可信度。这些个人、公司或组织与本平台间不存在任何雇佣、委任、代理、合伙或其他类似的关系。 本平台在游戏介绍下载页面、游戏相关留言板或论坛、游戏内可能刊登商业广告或其他推广活动信息。这些广告或推广活动信息是由广告商或商业服务提供者提供，并承担相应责任，本平台仅提供刊登内容的媒介。用户通过该等链接的网站或广告所购买的商品或服务，其交易行为仅存在于用户与该商品或服务的提供者之间，与本平台无关，本平台不就用户与该商品或服务的提供者之间所产生的交易行为承担任何法律责任，用户应予以特别留意。 <br>
        第三十一条信息的储存和安全及服务的限制 本平台对本协议下所提供的服务将尽力维护其安全性及方便性，但对服务中出现的信息（包括但不限于用户发布的信息）删除或储存失败不承担任何责任。本平台保留判定用户的行为是否符合本协议约定的权利，如果用户违背了本协议的约定，本平台有权中断依据本协议对用户提供的服务。 <br>
        第三十二条条款变更 本平台有权在必要的时候修改本协议条款，敬请用户定期查询有关内容。用户如继续使用本协议涉及的服务，则视为对修改内容的同意；用户在不同意修改内容的情况下，应当卸载本平台游戏、终止本协议并停止使用本平台服务。 <br>
        第三十三条游戏数据 在用户使用本平台服务过程中产生并储存于本平台服务器中的任何账号数据信息（包括但不限于用户个人身份数据信息等），属于本平台的一部分，由本平台所有并进行管理。在用户使用本平台游戏过程中产生并储存于本平台游戏服务器中的任何游戏数据信息（包括但不限于角色数据信息、等级及虚拟物品数据信息等），属于本平台游戏的一部分，由游戏权利人所有并进行管理。用户有权在遵守本协议的前提下通过正当的途径对属于自身用户账号的数据信息进行修改、转移、抛弃等。 <br>
        第三十四条通知 本平台所有发给用户的通知可通过游戏内、游戏介绍下载页面、游戏相关留言板或论坛、电子邮件、斩龙互娱消息或常规的电话、短信、信件等形式传送。同时，用户在此同意本平台可以向其电子邮箱、电话、短信、斩龙互娱消息、信件等方式发送商业信息。 <br>
        第三十五条用户所提供内容的知识产权及授权 本平台尊重知识产权并注重保护用户享有的各项权利。在本平台服务中，您可能需要通过上传、发布等各种方式向本平台提供内容。在此情况下，您仍然享有此等内容的完整知识产权。 您在此明确同意，您在提供前述内容的同时，不可撤销地授予本平台及其关联公司一项全球性的、永久的免费许可，允许本平台及其关联公司使用、传播、复制、修改、再许可、翻译、出版、表演及展示此等内容，以及使用此等内容创作衍生作品。 <br>
        第三十六条争议解决 本协议的订立、履行、解释及争议的解决均适用中华人民共和国法律并排除其他一切冲突法的适用。本协议订立于杭州市滨江区。如双方就本协议的内容或其执行发生任何争议（包括但不限于合同或者其他财产性权益纠纷），双方应友好协商解决；协商不成时，均应提交杭州仲裁委员会按照其仲裁规则进行仲裁。仲裁裁决是终局的，对双方均有约束力。 <br>
        第三十七条其他约定 为避免争议，本协议涉及到的有关数据、有关技术方面的问题，用户同意以本平台服务器所储存的数据作为判断标准。本平台保证该数据的真实性。 本协议所有条款的标题仅为方便阅读，本身并无实际涵义，不能作为本协议及相关条款涵义解释的依据。 如本协议中的任何条款因任何原因被判定为完全或部分无效或不具有执行力的，本协议的其他条款仍应有效并且有执行力。 本平台不行使、未能及时行使或者未充分行使本协议或者按照法律规定所享有的权利，不应被视为放弃该权利，也不影响本平台在将来行使该权利。
    </div>
</template>

<script>
export default {
    name: 'agreement',
    data () {
        return {}
    },
    methods: {},
    created () {},
    mounted () {}
}
</script>

<style lang="less" scoped>
#ruleText{
    padding: 10px;
    min-height: 100vh;
    background-color: #fff;
    text-align: left;
    font-size: 12px;
    color: #333;
    label{
        font-size: 14px;
        color: #333;
    }
    p{
        font-size: 12px;
        padding: 5px 0;
        color: #999;
    }
}
</style>
